[M_EllieDress MissionDefinition]
MissionName="Ellie e Sua Armadura Reluzente"
MissionDescription="Ellie, a espadachim está encarregada de proteger a população do [place]Refúgio Flamerock[-place].\nInfelizmente, ela precisa da coisa mais básica que qualquer espadachim que se preze deve possuir: uma armadura.\nEllie pediu para você ir até a [place]Floresta Negra[-place] e encontrar algo que possa servir para proteger seu lindo corpinho."
TurnInDescription="Podem magoar seus sentimentos com insultos e sarcasmos mas, pelo menos os Ogros não lhe causarão danos."
MissionSummary="Encontre alguma armadura para a Ellie."
MissionGiver="Ellie"
MissionTurnInLocation="Ellie"
TeaserText="A melhor defesa..."

[M_EllieDress:EllieDress_FindArmor MissionObjectiveDefinition]
ProgressMessage="Procure uma armadura"

[M_EllieDress:EllieDress_FindLessSexyArmor MissionObjectiveDefinition]
ProgressMessage="Encontre uma armadura menos sexy"

[M_EllieDress:EllieDress_KnockOutOfTree MissionObjectiveDefinition]
ProgressMessage="Tire a armadura da árvore"

[M_EllieDress:EllieDress_OS_BlankDialog MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_EllieDress:EllieDress_OS_FindArmor MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_EllieDress:EllieDress_OS_FindLessSexyArmor MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_EllieDress:EllieDress_OS_GoToArea MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_EllieDress:EllieDress_OS_KnockFromTree MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_EllieDress:EllieDress_OS_TreeDialog MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_EllieDress:EllieDress_OS_TurnInChoice MissionObjectiveSetBranchingDefinition]
MissionSummaryOverride="Entregue a Ellie a armadura sexy ou a volumosa."
MissionDescriptionOverride="Ellie, a espadachim está encarregada de proteger a população do [place]Refúgio Flamerock[-place].\nInfelizmente, ela precisa da coisa mais básica que qualquer espadachim que se preze deve possuir: uma armadura.\nEllie pediu para você ir até a [place]Floresta Negra[-place] e encontrar algo que possa servir para proteger seu lindo corpinho.\nVocê encontrou duas armaduras distintas: uma sexy e outra volumosa.  Você deve escolher qual modelo deseja entregar para a Ellie.\n"

[M_EllieDress:EllieDress_TurnInNotSexy MissionObjectiveDefinition]
ProgressMessage="Pegue a armadura volumosa"

[M_EllieDress:EllieDress_TurnInSexy MissionObjectiveDefinition]
ProgressMessage="Pegue o biquini de metal"

